IDEA Open Model
LineSegment2D Constructor
Compatible with IDEA StatiCa Beta 20.0
Initializes a new instance of the LineSegment2D class
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public LineSegment2D()
Public Sub New
See Also
Reference
LineSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace